; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v8 ?v12)
             (pred_5 ?v9 ?v11)
             (pred_1 ?v8 ?v11)
             (pred_7 ?v3 ?v8 )
	     (pred_9 ?v8)
             (pred_4 ?v5)
             (pred_8 ?v9)
             (pred_10 ?v11)
             (pred_12 ?v8)
             (pred_2 ?v9)
             (pred_3 ?v8)
             (pred_6 ))



(:action op_1
:parameters (?v10 ?v1 ?v4 ?v6)
:precondition (and (pred_4 ?v10) (pred_4 ?v1) (pred_8 ?v4) (pred_10 ?v6)
          (pred_11 ?v10 ?v1) (pred_5 ?v4 ?v6)
                   (pred_1 ?v1 ?v6) (pred_9 ?v10) 
                   (pred_12 ?v1) (pred_2 ?v4))
:effect (and  (pred_3 ?v1) (not (pred_12 ?v1))))


(:action op_5
:parameters (?v10 ?v13)
:precondition (and (pred_4 ?v10) (pred_4 ?v13)
               (pred_9 ?v10) (pred_11 ?v10 ?v13) (pred_3 ?v13))
:effect (and (pred_9 ?v13) (not (pred_9 ?v10))))

(:action op_3
:parameters (?v10 ?v4)
:precondition (and (pred_4 ?v10) (pred_8 ?v4) 
                  (pred_9 ?v10) (pred_7 ?v4 ?v10) (pred_6 ))
:effect (and (pred_2 ?v4)
   (not (pred_7 ?v4 ?v10)) (not (pred_6 ))))


(:action op_4
:parameters (?v10 ?v7 ?v2)
:precondition (and (pred_4 ?v10) (pred_8 ?v7) (pred_8 ?v2)
                  (pred_9 ?v10) (pred_2 ?v2) (pred_7 ?v7 ?v10))
:effect (and (pred_2 ?v7) (pred_7 ?v2 ?v10)
        (not (pred_2 ?v2)) (not (pred_7 ?v7 ?v10))))

(:action op_2
:parameters (?v10 ?v4)
:precondition (and (pred_4 ?v10) (pred_8 ?v4) 
                  (pred_9 ?v10) (pred_2 ?v4))
:effect (and (pred_6 ) (pred_7 ?v4 ?v10) (not (pred_2 ?v4)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_15 obj_02 obj_04 obj_10 obj_19 obj_20 obj_13 obj_07 obj_17 obj_05 obj_01 obj_18 obj_09 obj_08 obj_22
    obj_06 obj_12 obj_11
    obj_14 obj_03 obj_21
    )

    (:init
       (pred_6)

       (pred_4 obj_16)
       (pred_4 obj_15)
       (pred_4 obj_02)
       (pred_4 obj_04)
       (pred_4 obj_10)
       (pred_4 obj_19)
       (pred_4 obj_20)
       (pred_4 obj_13)
       (pred_4 obj_07)
       (pred_4 obj_17)
       (pred_4 obj_05)
       (pred_4 obj_01)
       (pred_4 obj_18)
       (pred_4 obj_09)
       (pred_4 obj_08)
       (pred_4 obj_22)
       (pred_10 obj_06)
       (pred_10 obj_12)
       (pred_10 obj_11)
       (pred_8 obj_14)
       (pred_8 obj_03)
       (pred_8 obj_21)

       (pred_11 obj_16 obj_10)
       (pred_11 obj_16 obj_15)
       (pred_11 obj_15 obj_19)
       (pred_11 obj_15 obj_02)
       (pred_11 obj_15 obj_16)
       (pred_11 obj_02 obj_20)
       (pred_11 obj_02 obj_04)
       (pred_11 obj_02 obj_15)
       (pred_11 obj_04 obj_13)
       (pred_11 obj_04 obj_02)
       (pred_11 obj_10 obj_07)
       (pred_11 obj_10 obj_19)
       (pred_11 obj_10 obj_16)
       (pred_11 obj_19 obj_17)
       (pred_11 obj_19 obj_20)
       (pred_11 obj_19 obj_15)
       (pred_11 obj_19 obj_10)
       (pred_11 obj_20 obj_05)
       (pred_11 obj_20 obj_13)
       (pred_11 obj_20 obj_02)
       (pred_11 obj_20 obj_19)
       (pred_11 obj_13 obj_01)
       (pred_11 obj_13 obj_04)
       (pred_11 obj_13 obj_20)
       (pred_11 obj_07 obj_18)
       (pred_11 obj_07 obj_17)
       (pred_11 obj_07 obj_10)
       (pred_11 obj_17 obj_09)
       (pred_11 obj_17 obj_05)
       (pred_11 obj_17 obj_19)
       (pred_11 obj_17 obj_07)
       (pred_11 obj_05 obj_08)
       (pred_11 obj_05 obj_01)
       (pred_11 obj_05 obj_20)
       (pred_11 obj_05 obj_17)
       (pred_11 obj_01 obj_22)
       (pred_11 obj_01 obj_13)
       (pred_11 obj_01 obj_05)
       (pred_11 obj_18 obj_09)
       (pred_11 obj_18 obj_07)
       (pred_11 obj_09 obj_08)
       (pred_11 obj_09 obj_17)
       (pred_11 obj_09 obj_18)
       (pred_11 obj_08 obj_22)
       (pred_11 obj_08 obj_05)
       (pred_11 obj_08 obj_09)
       (pred_11 obj_22 obj_01)
       (pred_11 obj_22 obj_08)
       (pred_12 obj_17)
       (pred_12 obj_05)
       (pred_12 obj_20)
       (pred_1  obj_17 obj_06)
       (pred_1  obj_05 obj_12)
       (pred_1  obj_20 obj_11)
       (pred_3 obj_16)
       (pred_3 obj_15)
       (pred_3 obj_02)
       (pred_3 obj_04)
       (pred_3 obj_10)
       (pred_3 obj_19)
       (pred_3 obj_13)
       (pred_3 obj_07)
       (pred_3 obj_01)
       (pred_3 obj_18)
       (pred_3 obj_09)
       (pred_3 obj_08)
       (pred_3 obj_22)

       (pred_5  obj_14 obj_06)
       (pred_5  obj_03 obj_12)
       (pred_5  obj_21 obj_11)
       (pred_7 obj_14 obj_13)
       (pred_7 obj_03 obj_13)
       (pred_7 obj_21 obj_22)
       (pred_9 obj_10)
    )

    (:goal (and
       (pred_7 obj_14 obj_10)
    ))
(:constraints
  (always (not (pred_9 obj_02)))
)
)

; plan
1. (op_5 obj_10 obj_07)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_07)
   goals met: 0 of 1
2. (op_5 obj_07 obj_18)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_18)
   goals met: 0 of 1
3. (op_5 obj_18 obj_09)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_09)
   goals met: 0 of 1
4. (op_5 obj_09 obj_08)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_08)
   goals met: 0 of 1
5. (op_5 obj_08 obj_22)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_22)
   goals met: 0 of 1
6. (op_5 obj_22 obj_01)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_01)
   goals met: 0 of 1
7. (op_5 obj_01 obj_13)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_13)
   goals met: 0 of 1
8. (op_3 obj_13 obj_14)
   deleted: (pred_7 obj_14 obj_13) (pred_6)
   added: (pred_2 obj_14)
   goals met: 0 of 1
9. (op_5 obj_13 obj_01)
   deleted: (pred_9 obj_13)
   added: (pred_9 obj_01)
   goals met: 0 of 1
10. (op_5 obj_01 obj_22)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_22)
   goals met: 0 of 1
11. (op_5 obj_22 obj_08)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_08)
   goals met: 0 of 1
12. (op_5 obj_08 obj_09)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_09)
   goals met: 0 of 1
13. (op_5 obj_09 obj_18)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_18)
   goals met: 0 of 1
14. (op_5 obj_18 obj_07)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_07)
   goals met: 0 of 1
15. (op_5 obj_07 obj_10)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_10)
   goals met: 0 of 1
16. (op_2 obj_10 obj_14)
   deleted: (pred_2 obj_14)
   added: (pred_6) (pred_7 obj_14 obj_10)
   goals met: 1 of 1
